---
title: WireConduitTypeSet
classe: Autodesk.Revit.DB.Electrical.WireConduitTypeSet
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# WireConduitTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `wireConduitTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `wireConduitTypeSet.Size` | Int32 |
| `Void Clear()` | `wireConduitTypeSet.Clear()` | Void |
| `Boolean Contains(WireConduitType)` | `wireConduitTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(WireConduitType)` | `wireConduitTypeSet.Erase(item)` | Int32 |
| `WireConduitTypeSetIterator ForwardIterator()` | `wireConduitTypeSet.ForwardIterator()` | WireConduitTypeSetIterator |
| `IEnumerator GetEnumerator()` | `wireConduitTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(WireConduitType)` | `wireConduitTypeSet.Insert(item)` | Boolean |
| `WireConduitTypeSetIterator ReverseIterator()` | `wireConduitTypeSet.ReverseIterator()` | WireConduitTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```